package com.e2i1.linkeepserver.common.constant;

import java.util.Arrays;
import java.util.List;
import lombok.AccessLevel;
import lombok.NoArgsConstructor;

@NoArgsConstructor(access = AccessLevel.PRIVATE)
public class NicknameConst {

    // 115개
    public static final List<String> ADJECTIVES = Arrays.asList(
        "가냘픈", "가는", "가파른", "같은", "거센", "건조한", "고른", "고마운", "고운", "고픈",
        "곧은", "괜찮은", "굳은", "굵은", "귀여운", "그런", "기다란", "기쁜", "긴", "깊은",
        "깨끗한", "날랜", "날카로운", "낮은", "너그러운", "너른", "널따란", "넓은", "네모난", "노란",
        "높은", "느린", "늦은", "동그란", "둥그런", "둥근", "뜨거운", "막다른", "많은", "매운",
        "멋진", "미끈미끈한", "바람직스러운", "반가운", "밝은", "보드라운", "보람찬", "부드러운", "부른", "붉은",
        "비싼", "빠른", "빨간", "뽀얀", "새로운", "서툰", "성가신", "센", "수다스러운", "수줍은",
        "쉬운", "슬픈", "시원찮은", "싼", "쌀쌀맞은", "쓰디쓴", "쓰린", "아름다운", "아쉬운", "알맞은",
        "얇은", "얕은", "어두운", "어려운", "어린", "엄청난", "예쁜", "올바른", "옳은", "외로운",
        "우스운", "의심쩍은", "이른", "익은", "있는", "작은", "잘난", "잘빠진", "재미있는", "적은",
        "젊은", "점잖은", "조그만", "좁은", "좋은", "줄기찬", "즐거운", "지나친", "지혜로운", "질긴",
        "짙은", "짧은", "큰", "탐스러운", "푸른", "하나같은", "한결같은", "흐린", "희망찬", "흰",
        "힘찬", "활기찬", "깔끔한", "차분한", "정교한"
    );

    public static final List<String> NOUNS = Arrays.asList(
        "호랑이", "사자", "기린", "코끼리", "하마", "코뿔소", "얼룩말", "늑대", "여우", "곰",
        "판다", "북극곰", "사슴", "갈매기", "앵무새", "백조", "펭귄", "돌고래", "상어", "고래",
        "뱀", "도마뱀", "악어", "거북", "이구아나", "개구리", "두꺼비", "매", "독수리", "부엉이",
        "고양이", "개", "햄스터", "기니피그", "토끼", "비버", "다람쥐", "너구리", "족제비", "몽구스",
        "침팬지", "오랑우탄", "고릴라", "원숭이", "마멋", "청설모", "스컹크", "수달", "하이에나", "아르마딜로",
        "캥거루", "코알라", "타조", "에뮤", "알파카", "라마", "플라밍고", "악어새", "바다표범", "해마",
        "큰바다거북", "칠면조", "오리", "거위", "백로", "황새", "공작", "비둘기", "까치", "앵무새",
        "설치류", "미어캣", "코요테", "울버린", "수달", "멧돼지", "호저", "마코호크", "콘도르", "박쥐",
        "청개구리", "이리", "바다사자", "미어캣", "와토가이", "필베", "누", "흰머리독수리", "황금독수리", "가젤",
        "영양", "바비루사", "노새", "올빼미", "바실리스크", "모래뱀", "보아뱀", "갈라파고스거북", "점박이물범", "포로투칸",
        "알바트로스", "오코피", "바다코끼리", "타프", "림프", "마자람"
    );

    public static final int WORD_NUM = NOUNS.size();

    public static final int RETRY_NUM = 10;

}
