package com.e2i1.linkeepserver.common.constant;

import java.util.Arrays;
import java.util.List;
import lombok.AccessLevel;
import lombok.NoArgsConstructor;

@NoArgsConstructor(access = AccessLevel.PRIVATE)
public class NicknameConst {

    // 115개
    public static final List<String> ADJECTIVES = Arrays.asList(
        "가냘픈", "가는", "가파른", "같은", "거센", "건조한", "고른", "고마운", "고운", "고픈",
        "곧은", "괜찮은", "굳은", "굵은", "귀여운", "그런", "기다란", "기쁜", "긴", "깊은",
        "깨끗한", "날랜", "날카로운", "낮은", "너그러운", "너른", "널따란", "넓은", "네모난", "노란",
        "높은", "느린", "늦은", "동그란", "둥그런", "둥근", "뜨거운", "막다른", "많은", "매운",
        "멋진", "미끈미끈한", "바람직스러운", "반가운", "밝은", "보드라운", "보람찬", "부드러운", "부른", "붉은",
        "비싼", "빠른", "빨간", "뽀얀", "새로운", "서툰", "성가신", "센", "수다스러운", "수줍은",
        "쉬운", "슬픈", "시원찮은", "싼", "쌀쌀맞은", "쓰디쓴", "쓰린", "아름다운", "아쉬운", "알맞은",
        "얇은", "얕은", "어두운", "어려운", "어린", "엄청난", "예쁜", "올바른", "옳은", "외로운",
        "우스운", "의심쩍은", "이른", "익은", "있는", "작은", "잘난", "잘빠진", "재미있는", "적은",
        "젊은", "점잖은", "조그만", "좁은", "좋은", "줄기찬", "즐거운", "지나친", "지혜로운", "질긴",
        "짙은", "짧은", "큰", "탐스러운", "푸른", "하나같은", "한결같은", "흐린", "희망찬", "흰",
        "힘찬", "활기찬", "깔끔한", "차분한", "정교한"
    );

    public static final List<String> NOUNS = Arrays.asList(
        "사과", "바나나", "커피", "책", "차", "고양이", "개", "꽃", "정원", "집",
        "섬", "주스", "키스", "나무", "달", "산", "새", "바다", "태양", "교통",
        "우산", "마을", "벽", "소", "시계", "노트북", "사진", "카메라", "라디오", "텔레비전",
        "핸드폰", "냉장고", "의자", "책상", "문", "창문", "시계", "램프", "거울", "그림",
        "침대", "담요", "이불", "베개", "소파", "커튼", "브러시", "병", "컵", "접시",
        "식탁", "커트러리", "나이프", "포크", "스푼", "전자레인지", "오븐", "요리", "음악", "노래",
        "춤", "영화", "비디오", "게임", "파티", "휴일", "선물", "카드", "편지", "책장",
        "화분", "식물", "색깔", "도구", "망치", "못", "조각", "패턴", "디자인", "모양",
        "크기", "무게", "공원", "길", "다리", "강", "숲", "계절", "여름", "가을",
        "겨울", "봄", "행복", "사랑", "기쁨", "슬픔", "분노", "두려움", "기대", "실망",
        "호기심", "평화", "전쟁", "뉴스", "신문", "잡지", "보고서", "이메일", "인터넷", "웹사이트",
        "프로그램", "소프트웨어", "하드웨어", "네트워크", "데이터"
    );

    public static final int WORD_NUM = NOUNS.size();

    public static final int RETRY_NUM = 10;

}
